import random


class 英雄:
    # 专精：结算时，如果你英雄池里所有的英雄都有同一个职业，那么额外加7分。
    # 全能：结算时，如果你英雄池里每个职业【战士、法师、刺客、坦克、射手、辅助】的英雄都至少有一个，那么额外加4分。
    #

    class 英雄:
        名字 = ''
        金币 = 0
        职业 = ''

    class 霞(英雄):
        名字 = "霞"
        金币 = 2
        职业 = ['射手']

    class 瑞兹(英雄):
        名字 = "瑞兹"
        金币 = 1
        职业 = ['法师']

    class 菲奥娜(英雄):
        名字 = "菲奥娜"
        金币 = 2
        职业 = ['战士']

    class 阿卡丽(英雄):
        名字 = "阿卡丽"
        金币 = 5
        职业 = ['战士', '刺客', '法师']

    class 卡莎(英雄):
        名字 = "卡莎"
        金币 = 4
        职业 = ['射手', '刺客', '法师']

    class 诺提勒斯(英雄):
        名字 = "诺提勒斯"
        金币 = 2
        职业 = ['坦克', '辅助']

    class 布里茨(英雄):
        名字 = "布里茨"
        金币 = 3
        职业 = ['坦克', '辅助']

    class 李青(英雄):
        名字 = "李青"
        金币 = 4
        职业 = ['战士']

    class 普朗克(英雄):
        名字 = "普朗克"
        金币 = 3
        职业 = ['战士']

    class 艾希(英雄):
        名字 = "艾希"
        金币 = 1
        职业 = ['射手']

    class 伊泽瑞尔(英雄):
        名字 = "伊泽瑞尔"
        金币 = 2
        职业 = ['射手']

    class 泽拉斯(英雄):
        名字 = "泽拉斯"
        金币 = 3
        职业 = ['法师']

    class 布兰德(英雄):
        名字 = "布兰德"
        金币 = 2
        职业 = ['法师']

    class 锤石(英雄):
        名字 = "锤石"
        金币 = 4
        职业 = ['坦克']

    class 阿狸(英雄):
        名字 = "阿狸"
        金币 = 2
        职业 = ['法师']

    class 亚索(英雄):
        名字 = "亚索"
        金币 = 5
        职业 = ['战士']

    class 易大师(英雄):
        名字 = "易大师"
        金币 = 1
        职业 = ['刺客', '战士']

    class 盖伦(英雄):
        名字 = "盖伦"
        金币 = 1
        职业 = ['战士', '坦克']

    class 德莱厄斯(英雄):
        名字 = "德莱厄斯"
        金币 = 1
        职业 = ['战士']

    class 德莱文(英雄):
        名字 = "德莱文"
        金币 = 3
        职业 = ['射手']

    class 卡特琳娜(英雄):
        名字 = "卡特琳娜"
        金币 = 3
        职业 = ['刺客', '法师']

    class 锐雯(英雄):
        名字 = "锐雯"
        金币 = 5
        职业 = ['战士']

    class 沃里克(英雄):
        名字 = "沃里克"
        金币 = 1
        职业 = ['战士']

    class 派克(英雄):
        名字 = "派克"
        金币 = 3
        职业 = ['辅助', '刺客']

    class 厄斐琉斯(英雄):
        名字 = "厄斐琉斯"
        金币 = 5
        职业 = ['射手']

    class 吉格斯(英雄):
        名字 = "吉格斯"
        金币 = 2
        职业 = ['法师']

    class 劫(英雄):
        名字 = "劫"
        金币 = 4
        职业 = ['刺客']

    class 悠米(英雄):
        名字 = "悠米"
        金币 = 1
        职业 = ['辅助']

    class 薇恩(英雄):
        名字 = "薇恩"
        金币 = 4
        职业 = ['射手']

    class 蒙多(英雄):
        名字 = "蒙多"
        金币 = 1
        职业 = ['坦克']

    class 妮蔻(英雄):
        名字 = "妮蔻"
        金币 = 1
        职业 = ['法师']

    class 索拉卡(英雄):
        名字 = "索拉卡"
        金币 = 1
        职业 = ['辅助']

    class 弗拉基米尔(英雄):
        名字 = "弗拉基米尔"
        金币 = 2
        职业 = ['法师']

    class 奥拉夫(英雄):
        名字 = "奥拉夫"
        金币 = 2
        职业 = ['战士']

    class 卢锡安(英雄):
        名字 = "卢锡安"
        金币 = 2
        职业 = ['射手']

    class 墨菲特(英雄):
        名字 = "墨菲特"
        金币 = 1
        职业 = ['刺客', '法师', '坦克']

    class 佐伊(英雄):
        名字 = "佐伊"
        金币 = 4
        职业 = ['法师']


if __name__ == "__main__":

    '''
    牌堆 = list()
    for 类 in 英雄.英雄.__subclasses__():
        牌堆.append(类())
    print(牌堆)
    '''

    all_cards = [[] for i in range(6)]
    for cls in 英雄.英雄.__subclasses__():
        all_cards[int(cls.金币)].append(cls.__name__)
        # all_cards[int(cls.金币)].append('*')
    for x in range(1, 6):
        print(f"{x}费卡 {len(all_cards[x])}张 {all_cards[x]}")
    print()
    职业 = {
        '战士': [],
        '法师': [],
        '刺客': [],
        '坦克': [],
        '射手': [],
        '辅助': [],
    }

    for cls in 英雄.英雄.__subclasses__():
        for s in cls.职业:
            职业[s].append(cls.__name__)
    for x in 职业:
        print(f"{x} {len(职业[x])}张 {职业[x]}")

    '''
    牌堆 = list()
    for 类 in 英雄.英雄.__subclasses__():
        if 类.金币 >= 5:
            for x in range(1):
                牌堆.append(类.__name__)

        elif 类.金币 >= 3:
            for x in range(2):
                牌堆.append(类.__name__)

        elif 类.金币 >= 1:
            for x in range(3):
                牌堆.append(类.__name__)

    random.shuffle(牌堆)
    for 牌 in 牌堆:
        print(牌)
    print(len(牌堆))
    '''


